app/views/masters/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."master_id" = $1  [["master_id", 11]]
---
<strong>Slaves:</strong>
<% @master.users.each do |user| %>