app/views/users/_form.html.erb

    <%= form.label :master_id %>
    <%= form.select :master_id, Master.pluck(:name, :id), :include_blank => true %>
---
SELECT "masters"."name", "masters"."id" FROM "masters"