app/views/users/_form.html.erb

SELECT "masters"."name", "masters"."id" FROM "masters"
---
	  <%= form.label :master_id %>
	  <%= form.select :master_id, Master.pluck(:name, :id), :include_blank => true %>