app/controllers/masters_controller.rb

  def index
    @masters = Master.all
---
SELECT "masters".* FROM "masters"

  def show
	master = Master.find params[:id]
---
SELECT  "masters".* FROM "masters" WHERE "masters"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]

  def create
    @master = Master.new(master_params)

    respond_to do |format|
      if @master.save
---
INSERT INTO "masters" ("name", "password_digest", "slave_id", "admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Tom"], ["password_digest", "chicken"], ["slave_id", 1], ["admin", true], ["created_at", "2019-05-13 05:08:25.733788"], ["updated_at", "2019-05-13 05:08:25.733788"]]

  def destroy
    @master.destroy
---
DELETE FROM "masters" WHERE "masters"."id" = $1  [["id", 3]]

    def set_master
      @master = Master.find(params[:id])
---
SELECT  "masters".* FROM "masters" WHERE "masters"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]