app/controllers/users_controller.rb

INSERT INTO "users" ("name", "place_cage", "custom_header", "created_at", "updated_at", "master_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Adlan"], ["place_cage", true], ["custom_header", true], ["created_at", "2019-05-14 01:48:33.341797"], ["updated_at", "2019-05-14 01:48:33.341797"], ["master_id", 2]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "fill_murray" = $1, "snap" = $2, "page_flip" = $3, "otherside" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["fill_murray", true], ["snap", true], ["page_flip", false], ["otherside", false], ["updated_at", "2019-05-16 12:17:48.884636"], ["id", 33]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)